[
  {
    "responsibilities": [
      "Promoted from Instructor in February 2023",
      "Instructed bootcamps and accelerated programs, covering a multitude of different languages and concepts including: HTML/CSS, JavaScript (fundamentals and advanced), Git, React, React-Router, Firebase, Accessibility (primarily the core requirements under WCAG) and implementation of modern web design.",
      "Helped over 200+ individuals through 10+ cohorts develop their skills, and succeed in their tech careers.",
      "Key activities included troubleshooting code, re-conceptualizing ideas and best practices during 1:1 and group mentor sessions, providing lectures on post-bootcamp content as well as soft-skill building (interview prep and portfolio critiques).",
      "Provided detailed and individualized feedback on projects and assignments, emphasizing performance optimization, adherence to modern best practices, and accessibility improvements to achieve learning objectives.",
      "Developed and updated curricula for full-time bootcamp, part-time bootcamp, and accelerated programs to incorporate changes in technology, new lesson content, and improve the clarity of existing content.",
      "Diagnosed and solved technical issues relating to core Juno repositories and the main Juno website as part of a task force, including migration to a newer codebase, implementation of new services, and reviewing program improvements."
    ],
    "employer": "Juno College",
    "title": "Intermediate Instructor",
    "dates": "February 2021 - April 2023",
    "location": "Toronto, ON"
  },
  {
    "responsibilities": [
      "* Built and optimized new features for the BMO website, including revamping web pages for offerings such as Bank Accounts, Credit Cards, and other marketing materials.",
      "Ensured all projects adhere to WCAG compliance and regulations.",
      "Proficient in HTML5, CSS3, React, and Redux for front-end development, as well as utilizing Cypress for unit testing new projects and pages.",
      "Collaborate with multiple departments to build and deliver new projects on a timely and efficient basis. This also includes working through product design and review during sprint planning and retro sessions."
    ],
    "employer": "BMO Financial Group",
    "title": "Frontend Developer",
    "dates": "July 2020 - February 2021",
    "location": "Toronto, ON"
  },
  {
    "responsibilities": [
      "Developed and optimized the PostBeyond Web Application",
      "Showcased proficiency in AngularJS, JavaScript, CoffeeScript, CSS3, Less, and Gulp. Utilized Git for version control and Docker for local environment development.",
      "Prototyped future iterations of the PostBeyond platform by reviewing use cases for using React and Redux in place of the existing frontend tech stack.",
      "Key activities included: evaluating the current limitations of the platform and the technological scope of the proposed idea, concluding with feedback, and testing the feasibility of implementation.",
      "Produce working prototypes of new design concepts and ideas within accelerated timelines and a fast-paced workstream to migrate the admin portion of the application from AngularJS to React, with Redux for state management, SASS for styling, and Jest for client-side testing."
    ],
    "title": "Front-End Developer",
    "employer": "Postbeyond Inc",
    "dates": "July 2019 - December 2019",
    "location": "Toronto, ON"
  },
  {
    "responsibilities": [
      "* Assisting instructors with teaching fundamentals of web technologies including HTML5, CSS3, JavaScript, jQuery, Node.js, React, Redux, Firebase, and Java.",
      "Providing students with real-world examples of production quality code, web standards and development methodologies; including WCAG, CRUD, Agile Development and SEO.",
      "Providing critique and feedback on assignments and group projects.",
      "Collaborate with other TA's and Instructors in developing new content for classes and stand-alone info sessions."
    ],
    "title": "Assistant Instructor",
    "employer": "University of Toronto",
    "dates": "March 2018 - July 2019",
    "location": "Toronto, ON"
  },
  {
    "responsibilities": [
      "Assist clients with reaching their website goals by creating websites and applications with modern frameworks and technologies; client first approaches, by using modern software to collaborate both ideas and content designs and page components.",
      "Utilize modern web design practices to create fully scalable webpages and applications including TDD, AGILE workflows, WCAG compliance, and DRY practices.",
      "Development languages including HTML5/CSS3, JavaScript, jQuery, Bootstrap, Ruby on Rails, MySQL, NoSQL, Node, React and Redux."
    ],
    "title": "Freelance Web Developer",
    "employer": "Self Employed",
    "dates": "May 2017 - June 2019",
    "location": "Toronto, ON"
  },
  {
    "responsibilities": [
      "* Respond and resolve technical support tickets in a timely manner, utilizing HTML5, CSS3, JavaScript and jQuery.",
      "Working with our clients on fixes and content changes to keep their websites up to date and compliant with regulatory standards.",
      "Ensuring the web support is running efficiently and effectively."
    ],
    "title": "Web Support Coordinator",
    "employer": "Q4 Inc",
    "dates": "June 2018 - September 2018",
    "location": "Toronto, ON"
  },
  {
    "responsibilities": [
      "Assist clients with up to date account information on various products and services including deposit accounts, credit cards, lending and investments. Provide clients with current information and changes within the financial industry (i.e. interest rate change notice, amendments in cardholder agreements).",
      "Deliver troubleshooting and advice towards CIBC banking products and services including debit/credit card transactions, online transactions and self-serve banking services. ",
      "Excellent customer service skills and positive attitude as demonstrated by receiving Award of Excellence Recipient for fiscal Quarter 1 2015, Quarter 1 2016 and Quarter 2 2016. Achieved by ending fiscal quarter over sales metrics and over achieving client satisfaction metrics"
    ],
    "title": "Financial Services Representative",
    "employer": "CIBC",
    "dates": "April 2014 - March 2017",
    "location": "Halifax, NS & Toronto, ON"
  },
  {
    "responsibilities": [
      "Performing customer care services such as: informing customers of new product and services, collecting monthly payments for wireline and wireless services. Handling account maintenance activities including: processing and servicing device activations and deactivations.",
      "Customer service skills and positive attitude as demonstrated by receiving employee of the month in four consecutive months in 2014 ",
      "Responsible for providing preliminary technical support for Wireline and Wireless products; including Cellular Devices, Internet Modems and Television Cable Boxes."
    ],
    "title": "Part Time Sales Representative",
    "employer": "Eastlink",
    "dates": "August 2012 - May 2014",
    "location": "Halifax, NS"
  }
]
